# SpaceType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..SpaceType Property
Space Class See Also
---
Get or set the Space type of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SpaceType SpaceType { get; set; }
```

Visual Basic
---
```text
Public Property SpaceType As SpaceType
	Get
	Set
```

Visual C++
---
```text
public:
property SpaceType SpaceType {
	SpaceType get ();
	void set (SpaceType value);
}
```

# Remarks
This property is used to get or set the Space type of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace